class Snake {
    constructor() {
        // инициализация змейки
        // например размер змейки, цвет
        // начальное позиционирование и другие параметры
    }

    death() {
        // логика смерти змейки
    }

    update() {
        // логика именно обновления змейки
        // при каких условиях необходимо меняться?
    }

    draw() {
        // логика отрисовки змейки
    }

    control() {
        // логика упрвления змейкой
        // обработка кнопок на клавиатуре
    }
}

export default Snake;